const 메뉴가격 = [2500, 3500, 4500, 5000, 6500];
const 가격인상 = []

//forEach 메서드는 가격 모든 요소를 순회하며 콜백 함수를 반복 호출
메뉴가격.forEach(item => 가격인상.push(item*1.2));
console.log(가격인상) //[ 3000, 4200, 5400, 6000, 7800 ]

//예제 27-97
//forEach 메서드는 콜백 함수를 호출하면서 3개(요소값, 인덱스, this)의 인수를 전달한다 
메뉴가격.forEach((item, index, arr)=>{
    console.log(`요소값: ${item}, 인덱스: ${index}, this:${JSON.stringify(arr)}`);
})
// 요소값: 2500, 인덱스: 0, this:[2500,3500,4500,5000,6500]
// 요소값: 3500, 인덱스: 1, this:[2500,3500,4500,5000,6500]
// 요소값: 4500, 인덱스: 2, this:[2500,3500,4500,5000,6500]
// 요소값: 5000, 인덱스: 3, this:[2500,3500,4500,5000,6500]
// 요소값: 6500, 인덱스: 4, this:[2500,3500,4500,5000,6500]

// 예제 27-98
// 콜백함수를 통해 원본 배열을 변경할 수는 있다. 
메뉴가격.forEach((item, index, arr) => { arr[index] = item*1.5; });
console.log(메뉴가격) //[ 3750, 5250, 6750, 7500, 9750 ]

// 예제 27-99
a = 메뉴가격.forEach((item, index, arr)=>console.log);
console.log(a) //undefined
